---
kind: property
id: P:Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.InputMemberIndex
source: html/4553dfd7-a7e9-d91d-db18-c1d98a66734c.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.InputMemberIndex Property

A index of the input member to which the restriction applies.

## Syntax (C#)
```csharp
public int InputMemberIndex { get; set; }
```